arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_lpspi_hal.h
/*
 * Copyright (c) 2013 - 2015, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#if !defined(__FSL_LPSPI_HAL_H__)
#define __FSL_LPSPI_HAL_H__

#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include "fsl_device_registers.h"



/*!
 * @addtogroup lpspi_hal LPSPI HAL
 * @ingroup lpspi
 * @brief Low Power Serial Peripheral Interface Hardware Abstraction Layer
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/*! @brief Error codes for the LPSPI driver. */
typedef enum _lpspi_status
{
    LPSPI_STATUS_SUCCESS = 0,
    LPSPI_STATUS_SLAVE_TX_UNDERRUN,       /*!< LPSPI Slave Tx Under run error */
    LPSPI_STATUS_SLAVE_RX_OVERRUN,        /*!< LPSPI Slave Rx Overrun error */
    LPSPI_STATUS_TIMEOUT,               /*!< LPSPI transfer timed out */
    LPSPI_STATUS_BUSY,                  /*!< LPSPI instance is already busy performing a
                                              transfer */
    LPSPI_STATUS_NO_TRANSFER_IN_PROGRESS,  /*!< Attempt to abort a transfer when no
                                              transfer was in progress */
    LPSPI_STATUS_TRANSFER_IN_PROGRESS,    /*!< Transfer in progress */
    LPSPI_STATUS_INVALID_BIT_COUNT,       /*!< bits-per-frame value not valid */
    LPSPI_STATUS_INVALID_INSTANCE_NUMBER, /*!< LPSPI instance number does not match
                                              current count */
    LPSPI_STATUS_OUT_OF_RANGE,            /*!< LPSPI delay of divisor out-of-range error */
    LPSPI_STATUS_BITCOUNT_OUT_OF_RANGE,    /*!< LPSPI bitcount parameter out-of-range error */
    LPSPI_STATUS_WATERMARK_OUT_OF_RANGE,   /*!< LPSPI watermark parameter out-of-range error */
    LPSPI_STATUS_INVALID_PARAMETER,      /*!< LPSPI invalid parameter error */
    LPSPI_STATUS_NON_INIT,               /*!< LPSPI driver does not initialize, not ready */
    LPSPI_STATUS_INITIALIZED,           /*!< LPSPI driver has been initialized, could not
                                              initialize again */
    LPSPI_STATUS_DMA_CHANNEL_INVALID,     /*!< LPSPI driver could not request
                                              DMA channel(s) */
    LPSPI_STATUS_ERROR,                 /*!< LPSPI driver error */
} lpspi_status_t;

/*! @brief LPSPI status flags. */
typedef enum _lpspi_status_flag {
    LPSPI_TX_DATA_FLAG       = LPSPI_SR_TDF_SHIFT, /*!< TX data flag */
    LPSPI_RX_DATA_FLAG       = LPSPI_SR_RDF_SHIFT, /*!< RX data flag */
    LPSPI_WORD_COMPLETE     = LPSPI_SR_WCF_SHIFT, /*!< Word Complete flag */
    LPSPI_FRAME_COMPLETE    = LPSPI_SR_FCF_SHIFT, /*!< Frame Complete flag */
    LPSPI_TRANSFER_COMPLETE = LPSPI_SR_TCF_SHIFT, /*!< Transfer Complete flag */
    LPSPI_TRANSMIT_ERROR    = LPSPI_SR_TEF_SHIFT, /*!< Transmit Error flag (FIFO underrun) */
    LPSPI_RECEIVE_ERROR     = LPSPI_SR_REF_SHIFT, /*!< Receive Error flag (FIFO overrun) */
    LPSPI_DATA_MATCH        = LPSPI_SR_DMF_SHIFT, /*!< Data Match flag */
    LPSPI_MODULE_BUSY       = LPSPI_SR_MBF_SHIFT, /*!< Module Busy flag */
    LPSPI_ALL_STATUS        = 0x00003F00U         /*!< Used for clearing all w1c status flags */
} lpspi_status_flag_t;

/*! @brief LPSPI Clock Signal (SCK) Polarity configuration. */
typedef enum _lpspi_sck_polarity {
    LPSPI_SCK_ACTIVE_HIGH = 0U, /*!< Signal is Active High (idles low). */
    LPSPI_SCK_ACTIVE_LOW  = 1U  /*!< Signal is Active Low (idles high). */
} lpspi_sck_polarity_t;

/*! @brief LPSPI Signal (PCS and Host Request) Polarity configuration. */
typedef enum _lpspi_signal_polarity {
    LPSPI_ACTIVE_HIGH = 1U, /*!< Signal is Active High (idles low). */
    LPSPI_ACTIVE_LOW  = 0U  /*!< Signal is Active Low (idles high). */
} lpspi_signal_polarity_t;

/*! @brief LPSPI Host Request select configuration. */
typedef enum _lpspi_host_request_select {
    LPSPI_HOST_REQ_EXT_PIN           = 0U, /*!< Host Request is an ext pin. */
    LPSPI_HOST_REQ_INTERNAL_TRIGGER  = 1U  /*!< Host Request is an internal trigger. */
} lpspi_host_request_select_t;

/*! @brief LPSPI master or slave configuration. */
typedef enum _lpspi_master_slave_mode {
    LPSPI_MASTER = 1U,     /*!< LPSPI peripheral operates in master mode. */
    LPSPI_SLAVE  = 0U      /*!< LPSPI peripheral operates in slave mode. */
} lpspi_master_slave_mode_t;

/*! @brief LPSPI Peripheral Chip Select (PCS) configuration (which PCS to configure)*/
typedef enum _lpspi_which_pcs {
    LPSPI_PCS0 = 0U, /*!< PCS[0] */
    LPSPI_PCS1 = 1U, /*!< PCS[1] */
    LPSPI_PCS2 = 2U, /*!< PCS[2] */
    LPSPI_PCS3 = 3U  /*!< PCS[3] */
} lpspi_which_pcs_t;

/*! @brief LPSPI Match configuration options. */
typedef enum _lpspi_match_config {
    LPSPI_MATCH_DISABLED                   = 0x0U, /*!< LPSPI Match Disabled. */
    LPSPI_1ST_WRD_EQUALS_M0_OR_M1              = 0x2U, /*!< LPSPI Match Enabled. */
    LPSPI_ANY_WRD_EQUALS_M0_OR_M1              = 0x3U, /*!< LPSPI Match Enabled. */
    LPSPI_1ST_WRD_EQUALS_M0_AND_2ND_WRD_EQUALS_M1 = 0x4U, /*!< LPSPI Match Enabled. */
    LPSPI_ANY_WRD_EQUALS_M0_AND_NXT_WRD_EQUALS_M1 = 0x5U, /*!< LPSPI Match Enabled. */
    LPSPI_1ST_WRD_AND_M1_EQUALS_M0_AND_M1        = 0x6U, /*!< LPSPI Match Enabled. */
    LPSPI_ANY_WRD_AND_M1_EQUALS_M0_AND_M1        = 0x7U, /*!< LPSPI Match Enabled. */
} lpspi_match_config_t;

