arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_lpspi_hal.h
/*! @brief LPSPI pin (SDO and SDI) configuration. */
typedef enum _lpspi_pin_config {
    LPSPI_SDI_IN_SDO_OUT = 0U,     /*!< LPSPI SDI input, SDO output. */
    LPSPI_SDO_IN_SDO_OUT = 1U,     /*!< LPSPI SDO input, SDO output. */
    LPSPI_SDI_IN_SDI_OUT = 2U,     /*!< LPSPI SDI input, SDI output. */
    LPSPI_SDO_IN_SDI_OUT = 3U      /*!< LPSPI SDO input, SDI output. */
} lpspi_pin_config_t;

/*! @brief LPSPI clock phase configuration. */
typedef enum _lpspi_clock_phase{
    LPSPI_CLOCK_PHASE_1ST_EDGE = 0U, /*!< Data captured on SCK 1st edge, changed on 2nd. */
    LPSPI_CLOCK_PHASE_2ND_EDGE = 1U  /*!< Data changed on SCK 1st edge, captured on 2nd. */
} lpspi_clock_phase_t;

/*! @brief LPSPI data shift direction configuration. */
typedef enum _lpspi_data_direction{
    LPSPI_MSB = 0U, /*!< Data shifted out MSB first */
    LPSPI_LSB = 1U  /*!< Data shifted out LSB first */
} lpspi_data_direction_t;

/*! @brief LPSPI data output configuration. */
typedef enum _lpspi_data_out_config{
    LPSPI_DATA_OUT_RETAINED = 0U, /*!< Data out retains last value when chip select de-asserted */
    LPSPI_DATA_OUT_TRISTATE = 1U  /*!< Data out is tri-stated when chip select de-asserted */
} lpspi_data_out_config_t;

/*! @brief LPSPI transfer width configuration. */
typedef enum _lpspi_transfer_width{
    LPSPI_SINGLE_BIT_XFER = 0U, /*!< 1-bit shift at a time, data out on SDO, in on SDI (normal mode) */
    LPSPI_TWO_BIT_XFER = 1U,    /*!< 2-bits shift out on SDO/SDI and in on SDO/SDI */
    LPSPI_FOUR_BIT_XFER = 2U    /*!< 4-bits shift out on SDO/SDI/PCS[3:2] and in on SDO/SDI/PCS[3:2] */
} lpspi_transfer_width_t;

/*! @brief LPSPI Transmit Command Register configuration structure.
 *
 * This structure contains the Transmit Command Register (TCR) settings. Any writes
 * to the TCR will cause the entire TCR contents to be pushed to the TX FIFO.
 * Therefore any updates to the TCR should include updates to all of the register
 * bit fields to form a 32-bit write to the TCR.
 */
typedef struct LpspiTxCmdConfig {
    uint32_t frameSize;              /*!< Number of bits/frame, minimum is 8-bits. */
    lpspi_transfer_width_t width;    /*!< Transfer width, single, 2-bit, or 4-bit transfer. */
    bool txMask;                     /*!< Option to mask the transmit data (won't load to FIFO). */
    bool rxMask;                     /*!< Option to mask the receive data (won't store in FIFO). */
    bool contCmd;                    /*!< Master option to change cmd word within cont transfer. */
    bool contTransfer;               /*!< Master option for continuous transfer. */
    bool byteSwap;                   /*!< Option to invoke the byte swap option in the FIFOs. */
    bool lsbFirst;                   /*!< Option to transmit LSB first. */
    lpspi_which_pcs_t whichPcs;      /*!< Selects which PCS to use. */
    uint32_t preDiv;      /*!< Selects the baud rate prescaler divider TCR bit setting. */
    lpspi_clock_phase_t clkPhase;    /*!< Selects which phase of clock to capture data. */
    lpspi_sck_polarity_t clkPolarity; /*!< Selects clock polarity. */
} lpspi_tx_cmd_config_t;

/*! @brief LPSPI initialization configuration structure.
 *
 * This structure contains parameters for the user to fill in to configure the LPSPI.
 * The user passes this structure into the LPSPI init function to configure it to
 * their desired parameters.
 * Example user code for:
    - 60MHz assumed, check ref manual for exact value
    - baudrate 500KHz
    - master mode
    - PCS is active low
   @code
    lpspi_init_config_t lpspiCfg;
    lpspiCfg.lpspiSrcClk = 60000000;
    lpspiCfg.baudRate = 500000;
    lpspiCfg.lpspiMode = LPSPI_MASTER;
    lpspiCfg.pcsPol = LPSPI_ACTIVE_LOW;
   @endcode
 */
typedef struct LpspiInitConfig {
    uint32_t lpspiSrcClk;                /*!< LPSPI module clock */
    uint32_t baudRate;                   /*!< LPSPI baudrate */
    lpspi_master_slave_mode_t lpspiMode; /*!< LPSPI master/slave mode */
    lpspi_signal_polarity_t pcsPol;      /*!< LPSPI PCS polarity */
} lpspi_init_config_t;

/*! @brief LPSPI delay type selection*/
typedef enum _lpspi_delay_type {
	LPSPI_SCK_TO_PCS = LPSPI_CCR_SCKPCS_SHIFT,     /*!< SCK to PCS Delay */
	LPSPI_PCS_TO_SCK = LPSPI_CCR_PCSSCK_SHIFT,     /*!< PCS to SCK Delay */
	LPSPI_BETWEEN_TRANSFER = LPSPI_CCR_DBT_SHIFT  /*!< Delay between transfers */
} lpspi_delay_type_t ;

/*******************************************************************************
 * Variables
 ******************************************************************************/
/* Defines constant value arrays for the baud rate pre-scalar values.*/
static const uint32_t s_baudratePrescaler[] = { 1, 2, 4, 8, 16, 32, 64, 128 };

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name Configuration
 * @{
 */

/*!
 * @brief Resets the LPSPI internal logic and registers to their default settings.
 *
 * This function first performs a software reset of the LPSPI module which resets the
 * internal LPSPI logic and most registers, then proceeds to manually reset all of the
 * LPSPI registers to their default setting to ensuring these registers at programmed to
 * their default value which includes disabling the module.
 *
 * @param Module base pointer of type LPSPI_Type.
 */
void LPSPI_HAL_Init(LPSPI_Type * base);

/*!
 * @brief Configures the LPSPI registers to a user defined configuration.
 *
 * Note, the LPSPI module must first be disabled prior to calling this function. It is recommended
 * to first call the LPSPI_HAL_Init function prior to calling this function.
 * This function configures the LPSPI based on the configuration passed in by the user
 * for normal SPI mode operation. Recommend single bit transfer: txCmd.width = LPSPI_SINGLE_BIT_XFER,
 * otherwise you will have to call function LPSPI_HAL_SetPinConfigMode to change the pin config.
 * This function sets the TX and RX FIFO watermarks to 0 such that the write blocking and read
 * blocking functions can be used following the init.
 *
 * @param Module base pointer of type LPSPI_Type.
 * @param config User configuration of type lpspi_init_config_t. Members of this struct are not
                 modifiable by the function.
 * @param actualBaudRate The actual, calculated baud rate passed back to the user
 * @param txCmdCfgSet Structure that contains the Transmit Command Register (TCR)
 *                    settings of type lpspi_tx_cmd_config_t. There is a member of this struct that
 *                    is modifiable by the function.
 * @return This function returns LPSPI_STATUS_ERROR if it is detected that an error occured
 *         during the LPSPI setup, otherwise, if success, it returns LPSPI_STATUS_SUCCESS.
 */
lpspi_status_t LPSPI_HAL_Config(LPSPI_Type * base, const lpspi_init_config_t * config,
                               lpspi_tx_cmd_config_t * txCmdCfgSet, uint32_t * actualBaudRate);

/*!
 * @brief Gets the Major, Minor and Feature ID of the LPSPI module.
 *
 * @ param Module base pointer of type LPSPI_Type.
 * @ param major The Major version number passed back to the user
 * @ param minor The Minor version number passed back to the user
 * @ param feature The Feature set number passed back to the user
 */
void LPSPI_HAL_GetVersionId(LPSPI_Type * base, uint32_t * major, uint32_t * minor,
                            uint32_t * feature);

/*!
 * @brief Enables the LPSPI module.
 *
 * @param Module base pointer of type LPSPI_Type.
 */
static inline void LPSPI_HAL_Enable(LPSPI_Type * base)
{
    BITBAND_ACCESS32(&(base->CR), LPSPI_CR_MEN_SHIFT) = (uint32_t)1U;
}

/*!
 * @brief Disables the LPSPI module.
 *
 * @param Module base pointer of type LPSPI_Type.
 * @return This function returns LPSPI_STATUS_BUSY if it is detected that the Module Busy Flag
 *         (MBF) is set, otherwise, if success, it returns LPSPI_STATUS_SUCCESS.
 */
lpspi_status_t LPSPI_HAL_Disable(LPSPI_Type * base);

/*!
 * @brief Configures the LPSPI for master or slave.
 *
 * Note that the LPSPI module must first be disabled before configuring this.
 *
 * @param Module base pointer of type LPSPI_Type.
 * @param mode Mode setting (master or slave) of type lpspi_master_slave_mode_t
 * @return This function returns the error condition LPSPI_STATUS_ERROR if the module is not
 *         disabled else it returns LPSPI_STATUS_SUCCESS.
 */
lpspi_status_t LPSPI_HAL_SetMasterSlaveMode(LPSPI_Type * base, lpspi_master_slave_mode_t mode);

/*!
 * @brief Returns whether the LPSPI module is in master mode.
 *
 * @param Module base pointer of type LPSPI_Type.
 * @return Returns true if LPSPI in master mode or false if in slave mode.
 */
static inline bool LPSPI_HAL_IsMaster(LPSPI_Type * base)
{
	return (bool)BITBAND_ACCESS32(&(base->CFGR1), LPSPI_CFGR1_MASTER_SHIFT);
}

/*!
 * @brief Gets the TX and RX FIFO sizes of the LPSPI module.
 *
 * @ param Module base pointer of type LPSPI_Type.
 * @ param txFifoSize The TX FIFO size passed back to the user
 * @ param rxFifoSize The RX FIFO size passed back to the user
 */
void LPSPI_HAL_GetFifoSizes(LPSPI_Type * base, uint32_t * txFifoSize, uint32_t * rxFifoSize);

/*!
 * @brief Flushes the LPSPI FIFOs.
 *
 * @param Module base pointer of type LPSPI_Type.
 * @param flushTxFifo Flushes (true) the Tx FIFO, else do not flush (false) the Tx FIFO
 * @param flushRxFifo Flushes (true) the Rx FIFO, else do not flush (false) the Rx FIFO
 */
void LPSPI_HAL_SetFlushFifoCmd(LPSPI_Type * base, bool flushTxFifo, bool flushRxFifo);

/*!
 * @brief Sets the TX and RX FIFO watermark values.
 *
 * This function allows the user to set the RX and TX FIFO watermarks. The function
 * does not compare the watermark setting to the FIFO size.  The FIFO watermark should not be
 * equal to or greater than the FIFO size.  It is up to the higher level driver to make this check.
 *
 * @param Module base pointer of type LPSPI_Type.
 * @param txWater The TX FIFO watermark value
 * @param rxWater The RX FIFO watermark value
 */
static inline void LPSPI_HAL_SetFifoWatermarks(LPSPI_Type * base, uint32_t txWater,
                                               uint32_t rxWater)
{
    uint32_t lpspi_tmp = base->FCR;
    lpspi_tmp &= ~(LPSPI_FCR_RXWATER_MASK | LPSPI_FCR_TXWATER_MASK);
    lpspi_tmp |= (rxWater << LPSPI_FCR_RXWATER_SHIFT)|(txWater);
	base->FCR = lpspi_tmp;

